erp3l/src/AccumulationRegisters/ПланыЗанятостиТрудовыхРесурсов/ПланыЗанятостиТрудовыхРесурсов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПланыЗанятостиТрудовыхРесурсов</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>УдалитьСпецификация</name>
    <type>
      <types>CatalogRef.РесурсныеСпецификации</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоНаЕдиницуПродукции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьНазначениеПродукции</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.СценарииТоварногоПланирования</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыПланов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРабот</name>
    <type>
      <types>CatalogRef.ВидыРаботСотрудников</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПодразделениеДиспетчер</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПодразделениеИсполнитель</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПланПроизводства</name>
    <type>
      <types>DocumentRef.ПланПроизводства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаПроизводства</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>СпецификацияПродукции</name>
    <type>
      <types>CatalogRef.РесурсныеСпецификации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НазначениеПродукции</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НоменклатураПродукции</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаПродукции</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РазделительРасчета</name>
    <type>
      <types>DefinedType.РазделительРасчетаПланаПроизводства</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

erp3l/src/Enums/СтатусыПланов/СтатусыПланов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыПланов</name>
  <comment>Статусы планов</comment>
  <enumValues>
    <name>Отменен</name>
  </enumValues>
  <enumValues>
    <name>ВПодготовке</name>
  </enumValues>
  <enumValues>
    <name>НаУтверждении</name>
  </enumValues>
  <enumValues>
    <name>Утвержден</name>
  </enumValues>
</mdclass:Enum>

erp3l/src/Documents/ПланПроизводства/ПланПроизводства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПланПроизводства</name>
  <registerRecords>AccumulationRegister.ОборотыБюджетов</registerRecords>
  <registerRecords>AccumulationRegister.ПланыВыпускаИзделий</registerRecords>
  <registerRecords>AccumulationRegister.ФактическиеДанныеБюджетирования</registerRecords>
  <registerRecords>AccumulationRegister.ПланыЗанятостиТрудовыхРесурсов</registerRecords>
  <registerRecords>AccumulationRegister.ПланыПроизводства</registerRecords>
  <registerRecords>AccumulationRegister.ПланыЗанятостиВидовРабочихЦентров</registerRecords>
  <registerRecords>AccumulationRegister.ПланыПотребленияМатериалов</registerRecords>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыПланов</types>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбновитьДополнить</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИзменитьРезультатНа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТочностьОкругления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательскиеНастройки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.СценарииТоварногоПланирования</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПлана</name>
    <type>
      <types>CatalogRef.ВидыПланов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполненоАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КроссТаблица</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктураНастроек</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполнятьПоФормуле</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтражаетсяВБюджетировании</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяБюджетов</name>
    <type>
      <types>CatalogRef.СтатьиБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>СценарийБюджетирования</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </attributes>
  <attributes>
    <name>Замещающий</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Назначение</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </attributes>
  <attributes>
    <name>УправлениеПроизводством2_2</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериодаЗамещения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипПроизводственногоПроцесса</name>
    <type>
      <types>EnumRef.ТипыПроизводственныхПроцессов</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособРасчетаПотребностейВМатериалах</name>
    <type>
      <types>EnumRef.СпособыРасчетаМатериалов</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполнятьАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполнятьПоДефициту</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазделительРасчета</name>
    <type>
      <types>DefinedType.РазделительРасчетаПланаПроизводства</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Продукция</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаЗапуска</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВыпуска</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Спецификация</name>
      <type>
        <types>CatalogRef.РесурсныеСпецификации</types>
      </type>
    </attributes>
    <attributes>
      <name>ДополнительныеПараметры</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>Отменено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Полуфабрикат</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <type>
        <types>CatalogRef.Назначения</types>
      </type>
    </attributes>
    <attributes>
      <name>Замещен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВыпускаПродукцииПолуфабриката</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаданИнтервалПотребности</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИнтервалПотребностиОт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИнтервалПотребностиДо</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаправлениеДеятельности</name>
      <type>
        <types>CatalogRef.НаправленияДеятельности</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗамещенКЗаказу</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПравилоЗаполнения</name>
    <attributes>
      <name>Использование</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Исключать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВариантПреобразования</name>
      <type>
        <types>EnumRef.ВариантыПреобразования</types>
      </type>
    </attributes>
    <attributes>
      <name>Источник</name>
      <type>
        <types>CatalogRef.ИсточникиДанныхПланирования</types>
      </type>
    </attributes>
    <attributes>
      <name>Период</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипЭлемента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерСтрокиРодитель</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПользовательскиеНастройки</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ИзменитьРезультатНа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Присоединять</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

erp3l/src/AccumulationRegisters/ПланыЗанятостиТрудовыхРесурсов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(ПодразделениеДиспетчер)
	|	И ЗначениеРазрешено(Сценарий)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбновлениеИнформационнойБазы

// см. ОбновлениеИнформационнойБазыБСП.ПриДобавленииОбработчиковОбновления
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт

	Обработчик = Обработчики.Добавить();
	Обработчик.Процедура = "РегистрыНакопления.ПланыЗанятостиТрудовыхРесурсов.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	Обработчик.Версия = "2.5.3.10";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("a347e660-c244-4309-9951-1ff0fc7d5057");
	Обработчик.ПроцедураЗаполненияДанныхОбновления = "РегистрыНакопления.ПланыЗанятостиТрудовыхРесурсов.ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию";
	Обработчик.ПроцедураПроверки = "ОбновлениеИнформационнойБазы.ДанныеОбновленыНаНовуюВерсиюПрограммы";
	Обработчик.Комментарий = НСтр("ru = 'Изменяет регистратор движений - вместо документа ""План производства"" устанавливается ""Регистратор плана производства"".
	|Заполняет измерения ""Спецификация продукции"" и ""Назначение продукции"".
	|Отменяет движения в статусе ""Отменен""';
	|en = 'Changes the movements recorder - sets the ""Production plan recorder"" instead of the ""Production plan"" document.
	|Fills in the ""Product BOM"" and ""Product purpose"" dimensions
	|Cancels movements in the ""Canceled"" status.'");
	
	Читаемые = Новый Массив;
	Читаемые.Добавить(Метаданные.Документы.РегистраторПланаПроизводства.ПолноеИмя());
	Читаемые.Добавить(Метаданные.РегистрыНакопления.ПланыЗанятостиТрудовыхРесурсов.ПолноеИмя());
	Обработчик.ЧитаемыеОбъекты = СтрСоединить(Читаемые, ",");
	
	Изменяемые = Новый Массив;
	Изменяемые.Добавить(Метаданные.РегистрыНакопления.ПланыЗанятостиТрудовыхРесурсов.ПолноеИмя());
	Обработчик.ИзменяемыеОбъекты = СтрСоединить(Изменяемые, ",");
	
	Обработчик.ПриоритетыВыполнения = ОбновлениеИнформационнойБазы.ПриоритетыВыполненияОбработчика();

	НоваяСтрока = Обработчик.ПриоритетыВыполнения.Добавить();
	НоваяСтрока.Процедура = "Документы.ПланПроизводства.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	НоваяСтрока.Порядок = "После";

КонецПроцедуры

// Параметры:
// 	Параметры - см. ОбновлениеИнформационнойБазы.ОсновныеПараметрыОтметкиКОбработке
//
Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПланыЗанятостиТрудовыхРесурсов.Регистратор КАК Ссылка
		|ИЗ
		|	РегистрНакопления.ПланыЗанятостиТрудовыхРесурсов КАК ПланыЗанятостиТрудовыхРесурсов
		|ГДЕ
		|	ПланыЗанятостиТрудовыхРесурсов.Регистратор ССЫЛКА Документ.ПланПроизводства
		|	ИЛИ ПланыЗанятостиТрудовыхРесурсов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПланов.Отменен)");
	
	ДополнительныеПараметры = ОбновлениеИнформационнойБазы.ДополнительныеПараметрыОтметкиОбработки();
	ДополнительныеПараметры.ЭтоДвижения = Истина;
	ДополнительныеПараметры.ПолноеИмяРегистра = "РегистрНакопления.ПланыЗанятостиТрудовыхРесурсов";
	
	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(
		Параметры,
		Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"),
		ДополнительныеПараметры);
	
КонецПроцедуры

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт

	ПолноеИмяРегистра = "РегистрНакопления.ПланыЗанятостиТрудовыхРесурсов";
	
	ДополнительныеПараметры = ОбновлениеИнформационнойБазы.ДополнительныеПараметрыОтметкиОбработки();
	ДополнительныеПараметры.ЭтоДвижения = Истина;
	ДополнительныеПараметры.ПолноеИмяРегистра = ПолноеИмяРегистра;
	
	Выборка = ОбновлениеИнформационнойБазы.ВыбратьРегистраторыРегистраДляОбработки(
		Параметры.Очередь,
		,
		ПолноеИмяРегистра);
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ПланыЗанятостиТрудовыхРесурсов.Период КАК Период,
		|	ПланыЗанятостиТрудовыхРесурсов.Регистратор КАК Регистратор,
		|	ПланыЗанятостиТрудовыхРесурсов.НомерСтроки КАК НомерСтроки,
		|	ПланыЗанятостиТрудовыхРесурсов.Активность КАК Активность,
		|	ПланыЗанятостиТрудовыхРесурсов.Сценарий КАК Сценарий,
		|	ПланыЗанятостиТрудовыхРесурсов.Статус КАК Статус,
		|	ПланыЗанятостиТрудовыхРесурсов.ВидРабот КАК ВидРабот,
		|	ПланыЗанятостиТрудовыхРесурсов.ПодразделениеДиспетчер КАК ПодразделениеДиспетчер,
		|	ПланыЗанятостиТрудовыхРесурсов.ПодразделениеИсполнитель КАК ПодразделениеИсполнитель,
		|	ПланыЗанятостиТрудовыхРесурсов.ПланПроизводства КАК ПланПроизводства,
		|	ПланыЗанятостиТрудовыхРесурсов.ДатаПроизводства КАК ДатаПроизводства,
		|	ПланыЗанятостиТрудовыхРесурсов.УдалитьСпецификация КАК СпецификацияПродукции,
		|	ПланыЗанятостиТрудовыхРесурсов.УдалитьНазначениеПродукции КАК НазначениеПродукции,
		|	ПланыЗанятостиТрудовыхРесурсов.НоменклатураПродукции КАК НоменклатураПродукции,
		|	ПланыЗанятостиТрудовыхРесурсов.ХарактеристикаПродукции КАК ХарактеристикаПродукции,
		|	ПланыЗанятостиТрудовыхРесурсов.РазделительРасчета КАК РазделительРасчета,
		|	ПланыЗанятостиТрудовыхРесурсов.Количество КАК Количество,
		|	ПланыЗанятостиТрудовыхРесурсов.КоличествоНаЕдиницуПродукции КАК КоличествоНаЕдиницуПродукции,
		|	ПланыЗанятостиТрудовыхРесурсов.УдалитьСпецификация КАК УдалитьСпецификация,
		|	ПланыЗанятостиТрудовыхРесурсов.УдалитьНазначениеПродукции КАК УдалитьНазначениеПродукции
		|ИЗ
		|	РегистрНакопления.ПланыЗанятостиТрудовыхРесурсов КАК ПланыЗанятостиТрудовыхРесурсов
		|ГДЕ
		|	ПланыЗанятостиТрудовыхРесурсов.Регистратор = &Регистратор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	РегистраторПланаПроизводства.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.РегистраторПланаПроизводства КАК РегистраторПланаПроизводства
		|ГДЕ
		|	РегистраторПланаПроизводства.ПланПроизводства = &Регистратор
		|	И РегистраторПланаПроизводства.Проведен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ДокументПланПроизводства.Статус КАК Статус
		|ИЗ
		|	Документ.ПланПроизводства КАК ДокументПланПроизводства
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РегистраторПланаПроизводства КАК РегистраторПланаПроизводства
		|		ПО РегистраторПланаПроизводства.ПланПроизводства = ДокументПланПроизводства.Ссылка
		|ГДЕ
		|	(ДокументПланПроизводства.Ссылка = &Регистратор
		|			ИЛИ РегистраторПланаПроизводства.Ссылка = &Регистратор)");
	
	Пока Выборка.Следующий() Цикл
		
		НачатьТранзакцию();
		Попытка
			
			Блокировка = Новый БлокировкаДанных;
			
			ЭлементБлокировки = Блокировка.Добавить(ПолноеИмяРегистра + ".НаборЗаписей");
			ЭлементБлокировки.УстановитьЗначение("Регистратор", Выборка.Регистратор);
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			
			ЭлементБлокировки = Блокировка.Добавить("Документ.РегистраторПланаПроизводства");
			Если ТипЗнч(Выборка.Регистратор) = Тип("ДокументСсылка.ПланПроизводства") Тогда
				ЭлементБлокировки.УстановитьЗначение("ПланПроизводства", Выборка.Регистратор);
			Иначе
				ЭлементБлокировки.УстановитьЗначение("Ссылка", Выборка.Регистратор);
			КонецЕсли;
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Разделяемый;
			
			Блокировка.Заблокировать();
			
			Запрос.УстановитьПараметр("Регистратор", Выборка.Регистратор);
			МассивРезультатов = Запрос.ВыполнитьПакет();
			
			ВыборкаСтатус = МассивРезультатов[2].Выбрать();
			
			Если ВыборкаСтатус.Следующий() 
				И ВыборкаСтатус.Статус = Перечисления.СтатусыПланов.Отменен Тогда
				
				НаборЗаписейСтарый = РегистрыНакопления.ПланыЗанятостиТрудовыхРесурсов.СоздатьНаборЗаписей();
				НаборЗаписейСтарый.Отбор.Регистратор.Установить(Выборка.Регистратор);
				ОбновлениеИнформационнойБазы.ЗаписатьДанные(НаборЗаписейСтарый);
				
			ИначеЕсли Не МассивРезультатов[0].Пустой()
				И Не МассивРезультатов[1].Пустой() Тогда
				
				НаборЗаписейНовый = РегистрыНакопления.ПланыЗанятостиТрудовыхРесурсов.СоздатьНаборЗаписей();
				НаборЗаписейНовый.Отбор.Регистратор.Установить(МассивРезультатов[1].Выгрузить()[0].Ссылка);
				НаборЗаписейНовый.Загрузить(МассивРезультатов[0].Выгрузить());
				ОбновлениеИнформационнойБазы.ЗаписатьДанные(НаборЗаписейНовый);
				
				НаборЗаписейСтарый = РегистрыНакопления.ПланыЗанятостиТрудовыхРесурсов.СоздатьНаборЗаписей();
				НаборЗаписейСтарый.Отбор.Регистратор.Установить(Выборка.Регистратор);
				ОбновлениеИнформационнойБазы.ЗаписатьДанные(НаборЗаписейСтарый);
				
			Иначе
				
				ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(Выборка.Регистратор, ДополнительныеПараметры);
				
			КонецЕсли;
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			ОбновлениеИнформационнойБазыУТ.СообщитьОНеудачнойОбработке(ИнформацияОбОшибке(), Выборка.Регистратор);
			
		КонецПопытки;
		
	КонецЦикла;
	
	Параметры.ОбработкаЗавершена = Не ОбновлениеИнформационнойБазы.ЕстьДанныеДляОбработки(Параметры.Очередь, ПолноеИмяРегистра);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
